//№1
// let a = '5' + '2';
// alert(a);
// Результат: 52

//№2
// let a = '5' + 2;
// alert(a);
// Результат: 52

//№3
// let a = 5 + '2';
// alert(a);
// Результат: 52

//№4
// let a = 5 + 2;
// alert(a);
// Результат: 7

//№5
// let a = '5' * '2';
// alert(a);
// Результат: 10

//№6
// let a = '5' - '2';
// alert(a);
// Результат: 3

//№7
// let a = '5' / '2';
// alert(a);
// Результат: 2.5

//№8
// let a = '5' % '2';
// alert(a);
// Результат: 1

//№9
// let a = '5s' * '2';
// alert(a);
// Результат: NaN

//№10
// let a = '5s' + '2';
// alert(a);
// Результат: 5s2

//№11
// let a = (-'5') + (-'2');
// alert(a);
// Результат: -7

//№12
// let a = '5' * 1 + '2' * 1;
// alert(a);
// Результат: 52

//№13
// let a = '5' * '1' + '2' * '1';
// alert(a);
// Результат: 52

//№14
// let a = '' + 3 + 1;
// alert(a);
// Результат: 31